# Datumfuncties

In [2]:
%LOAD data/example.db

Er zijn ontzettend veel mogelijkheden met datumfuncties. Een overzicht vind je hier:

https://dev.mysql.com/doc/refman/5.5/en/date-and-time-functions.html

De belangrijkste datumfuncties worden hierna behandeld.

## Sysdate

Met `SYSDATE()` haal je de systeemdatum op, de datum van vandaag. Hetzelfde bereik je min of meer met NOW(), LOCALTIME of LOCALTIMESTAMP. Er zijn subtiele verschillen.

SQLite: SYSDATE(), NOW(), LOCALTIME, LOCALTIMESTAMP zijn niet beschikbaar; gebruik `DATE('now')`. (En voor de tijd?)

```SQL
SELECT SYSDATE(), NOW(), LOCALTIME, LOCALTIMESTAMP;
```

In [7]:
SELECT DATE('now');

+-------------+
| DATE('now') |
+-------------+
| 2023-07-05  |
+-------------+

In [11]:
SELECT TIME ('now');

+--------------+
| TIME ('now') |
+--------------+
| 07:46:02     |
+--------------+

In [12]:
SELECT DATETIME('now')

+---------------------+
| DATETIME('now')     |
+---------------------+
| 2023-07-05 07:48:16 |
+---------------------+

## Day

Met DAY haal je het nummer van de dag op van een datum.

In [13]:
SELECT last_name, hire_date, DAY(hire_date)
FROM employees
WHERE last_name = 'King';

Error: no such function: DAY

Als je de naam van de dag wil, dan gebruik je DAYNAME.

In [14]:
SELECT last_name, hire_date, DAYNAME(hire_date)
FROM employees
WHERE last_name = 'King';

Error: no such function: DAYNAME

## Month

Met MONTH haal je het nummer van de maand op van een datum.

In [15]:
SELECT last_name, hire_date, MONTH(hire_date)
FROM employees
WHERE last_name = 'King';

Error: no such function: MONTH

Als je de naam van de maand wil, dan gebruik je MONTHNAME.

In [16]:
SELECT last_name, hire_date, MONTHNAME(hire_date)
FROM employees
WHERE last_name = 'King';

Error: no such function: MONTHNAME

## Year

Met YEAR haal je het jaar op van een datum.

In [17]:
SELECT last_name, hire_date, YEAR(hire_date)
FROM employees
WHERE last_name = 'King';

Error: no such function: YEAR

Op deze manier kun je datums van elkaar aftrekken. Bij jaren wordt dan de uitkomst naar beneden afgerond.

In [18]:
SELECT last_name, YEAR(hire_date), YEAR(NOW()), YEAR(NOW())-YEAR(hire_date) AS dienstjaren
FROM employees
WHERE last_name = 'King';

Error: no such function: YEAR

## Date_add

Met DATE_ADD kun je dagen, maanden of jaren toevoegen aan een datum. Met INTERVAL geef je aan wat en hoeveel je wil toevoegen. In onderstaande voorbeelden wordt achtereenvolgens 6 dagen, 6 maanden en 6 jaar toegevoegd aan de hire_date.

In [19]:
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 DAY)
FROM employees
WHERE last_name = 'King';

Error: near "6": syntax error

In [20]:
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 MONTH)
FROM employees
WHERE last_name = 'King';

Error: near "6": syntax error

In [21]:
SELECT last_name, hire_date, DATE_ADD(hire_date, INTERVAL 6 YEAR)
FROM employees
WHERE last_name = 'King';

Error: near "6": syntax error

## Timestampdiff

Met TIMESTAMPDIFF kun je het verschil tussen twee datums uitrekenen, bijvoorbeeld in jaren of maanden.

In [22]:
SELECT last_name, hire_date, TIMESTAMPDIFF(YEAR, hire_date, SYSDATE())
FROM employees
WHERE last_name = 'King';

Error: no such column: YEAR

In [23]:
SELECT last_name, hire_date, TIMESTAMPDIFF(MONTH, hire_date, SYSDATE())
FROM employees
WHERE last_name = 'King';

Error: no such column: MONTH

## Date_format

Datumvelden kun je op allerlei mogelijke manieren vormgeven met DATE_FORMAT. Een overzicht van alle mogelijkheden vind je hier:

https://dev.mysql.com/doc/refman/5.5/en/date-and-time-functions.html#function_date-format

In [24]:
SELECT last_name, hire_date, DATE_FORMAT(hire_date, '%d %M %Y')
FROM employees
WHERE last_name = 'King';

Error: no such function: DATE_FORMAT

Als je de uitvoer in het Nederlands wil, dan kun je met een SET de local time name op Nederlands zetten. In dit voorbeeld zie je dan juni in het Nederlands in plaats van June in het Engels. Let op dat er op het eind van de SET een puntkomma staat! Het zijn dus eigenljk twee commando's achter elkaar. Je kunt de SET regel ook los invoeren en dan werkt de instelling zolang je in dezelfde sessie bent. Als je de beheerder zou zijn van de database, dan kun je deze SET vastleggen zodat je altijd de uitvoer in het Nederlands hebt.

In [25]:
SET lc_time_names = 'nl_NL';

SELECT last_name, hire_date, DATE_FORMAT(hire_date, '%d %M %Y')
FROM employees
WHERE last_name = 'King';

Error: near "SET": syntax error

In [29]:
SELECT DATE_ADD(DATE('now'), INTERVAL '30' DAY');

Error: near "'30'": syntax error

In [28]:
SELECT DATE('now', '+30 day');

+------------------------+
| DATE('now', '+30 day') |
+------------------------+
| 2023-08-04             |
+------------------------+

NB: voor het bepalen van het verschil van twee data (tijden?): zet deze eerst om in "JULIANDAY", en bepaal dan het verschil.